Tekla Open API Reference for Tekla Structures 2025
DrawingObject.ToString Method
 Changes the string presentation of the drawing object.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public override string ToString()
Public Overrides Function ToString As String
Return Value
Type: String
The name of the current drawing object.
See Also
Reference
DrawingObject Class
Tekla.Structures.Drawing Namespace